export const PATTERN_VALIDATION = {
  login: '/^[А-ЯЁ]([а-яё]{1,29})([-][А-ЯЁ]([а-яё]{1,29}))$/g',
  password: '/^[S]{8,30}$/g',
  email: '/^[A-Za-z0-9,.,-]{1,}[@]([A-Za-z0-9,.,-]{1,}[.][A-Za-z]{1,}){1,2}$/g',
  phone: '/^(+7|8)(([(]9d{2}[)])|(s?9d{2}))(s|[-])?(d{3})[-]?(d{2})[-]?(d{2})$/g',
};

export const MESSAGES_VALIDATION = {
  login: 'Логин должен начинаться с заглавной буквы от 3 до 30 символов на русском языке',
  password: '/^[S]{8,30}$/g',
  email: '/^[A-Za-z0-9,.,-]{1,}[@]([A-Za-z0-9,.,-]{1,}[.][A-Za-z]{1,}){1,2}$/g',
  phone: '/^(+7|8)(([(]9d{2}[)])|(s?9d{2}))(s|[-])?(d{3})[-]?(d{2})[-]?(d{2})$/g',
};
